PluseLin/EP-Robot-ESP32-flask/CameraWebServer/app_httpd.cpp
    /*摄像头截取*/
    httpd_uri_t capture_uri = {
        .uri = "/capture",
        .method = HTTP_GET,
        .handler = capture_handler,
        .user_ctx = NULL
    };

    /*控制部分*/
    httpd_uri_t control_uri = {
        .uri = "/control",
        .method = HTTP_POST,
        .handler = ctrl_handler,
        .user_ctx = NULL
    };

    /*温度传感器部分*/
    httpd_uri_t temp_uri={
        .uri="/temperature",
        .method= HTTP_GET,
        .handler=temp_handler,
        .user_ctx=NULL
    };


    ra_filter_init(&ra_filter, 20);

#if CONFIG_ESP_FACE_RECOGNITION_ENABLED
    recognizer.set_partition(ESP_PARTITION_TYPE_DATA, ESP_PARTITION_SUBTYPE_ANY, "fr");

    // load ids from flash partition
    recognizer.set_ids_from_flash();
#endif
    ESP_LOGI(TAG, "Starting web server on port: '%d'", config.server_port);
    if (httpd_start(&camera_httpd, &config) == ESP_OK)
    {
        //httpd_register_uri_handler(camera_httpd, &index_uri);
        // httpd_register_uri_handler(camera_httpd, &cmd_uri);
        // httpd_register_uri_handler(camera_httpd, &status_uri);
        httpd_register_uri_handler(camera_httpd, &capture_uri);
        httpd_register_uri_handler(camera_httpd, &temp_uri);
        httpd_register_uri_handler(camera_httpd, &control_uri);
        httpd_register_uri_handler(camera_httpd, &stream_uri);
        // httpd_register_uri_handler(camera_httpd, &bmp_uri);

        // httpd_register_uri_handler(camera_httpd, &xclk_uri);
        // httpd_register_uri_handler(camera_httpd, &reg_uri);
        // httpd_register_uri_handler(camera_httpd, &greg_uri);
        // httpd_register_uri_handler(camera_httpd, &pll_uri);
        // httpd_register_uri_handler(camera_httpd, &win_uri);
    }

    config.server_port += 1;
    config.ctrl_port += 1;
    ESP_LOGI(TAG, "Starting stream server on port: '%d'", config.server_port);
    if (httpd_start(&stream_httpd, &config) == ESP_OK)
    {
        httpd_register_uri_handler(stream_httpd, &stream_uri);
    }
}
